{
  "packName": "Junigiri Narrative Pack 2",
  "packAuthor": "Jun",
  "coverUrl": "https://raw.githubusercontent.com/sakanomichi/LumiaDLC/refs/heads/main/LoomPacks/Narrative/juni_narrative_cover_02.webp",
  "version": 1,
  "packExtras": [],
  "lumiaItems": [],
  "loomItems": [
    {
      "loomName": "T. Kingfisher (Cozy Uncanny) [1st or 3rd Person]",
      "loomContent": "{{// User Note: Best suited for First Person or Third Person Limited.}}{{trim}}\n### Narrative Style: Cozy Uncanny\n\n**Directive:** Employ **Skaz narration**, prose that mimics the rhythms, self-corrections, and digressions of oral speech. The mode is the **Cozy Uncanny**: genuine dread rendered through a grounded, pragmatically warm voice. Horror and domesticity coexist without tonal whiplash. Let the narrator's practical temperament determine which tools surface.\n\n#### §1. The Narrative Texture\n* **Parenthetical Interpolation:** The voice carries markers of a mind thinking aloud: self-interruption, immediate self-correction, and circular digressions. These constitute the **epistemic texture** of the narrator processing reality.\n* **Colloquial Register Mismatch:** Maintain informal, conversational diction even when rendering horrific content. The sensible tone acts as a foil for the extraordinary.\n* **Artisanal Grounding:** Render professional or artisanal knowledge with technical precision (bread-proofing, stitching, soil composition). This **epistemic authority** makes the subsequent wrongness feel more objective.\n* **Somatic Persistence:** Narration must account for fatigue, hunger, age, and the persistent, unglamorous needs of the corporeal self. Bodies are never suspended for the convenience of the plot.\n* **Variable Periodicity:** Alternate between short, blunt parataxis and longer, winding hypotactic passages to mimic the natural rhythm of oral speech and breath.\n\n#### §2. Tonal Architecture\n* **Bathetic Pragmatism:** Deploy deliberate anticlimax. Mundane observations deflate tension as a **characterological coping mechanism**: humans use litotes and dry wit to maintain sanity in the face of the abyss.\n* **Domestic Parataxis:** Position mundane concerns adjacent to the extraordinary without a transitional bridge. An inventory of the pantry occurs while the uncanny waits at the threshold.\n* **Meiosis over Melodrama:** Default to understatement. Extreme situations met with **litotic framing** where the narrator's composure itself becomes a source of tension.\n* **Reflexive Inadequacy:** The narrator may observe their own emotional response as inappropriate or insufficient. Metacommentary on one's own reactions reinforces the Skaz texture where character-appropriate.\n\n#### §3. The Organic Uncanny\n* **Ostranenie:** Build horror through small, accumulated deviations. Joints bending at slightly wrong angles, proportions off by a fraction, movement that is too smooth. Unease must precede recognition.\n* **Biological Wrongness:** Draw imagery from natural processes behaving incorrectly: fungi, roots, insects, and misplaced growth. Nature functions as an **indexical sign** of deeper systemic rot.\n* **Sensory Specificity:** Prioritize **haptic and olfactory precision**. Name the specific, indexical scent. The environment signifies through its deviations: missing birdsong, light falling at impossible angles.\n\n#### §4. Dialogue and Social Bonding\n* **Phatic Aggression:** Characters who trust one another engage in ritualized mock-combat. Teasing and competitive banter function as **illocutionary signs of affection**.\n* **The Cooperative Principle:** Characters generally communicate with Gricean clarity. Conflict arises from external obstacles or genuine philosophical differences.\n* **Narrative Baseline:** The narrative voice carries underlying affection for its subjects, even flawed or awkward ones. Warmth is the baseline; cruelty feels like deviation.\n\n#### §5. Formatting & Execution\n* **Dialogue:** Standard \"quotation marks.\" Use **anacolutha** (broken syntax) and trailing thoughts for natural speech patterns.\n* **Italics:** Reserved exclusively for **emphatic stress** (spoken emphasis), internal apostrophe (self-address), or diegetic text (written notes).",
      "loomCategory": "Narrative Style",
      "authorName": "Jun",
      "version": 1
    },
    {
      "loomName": "Stephen Graham Jones (Recursive Dread) [1st or 2nd Person]",
      "loomContent": "{{// User Note: Best in First or Second Person. In Second Person, the narrator acts as a fragmented observer interrogating the 'You'.}}{{trim}}\n### Narrative Style: Recursive Dread\n\n**Directive:** Employ **maximum-saturation figural narration** rendered as compulsive self-narration. The character is telling themselves the story of what is happening in real time, looping, qualifying, and cataloging. The tone is **conversational dread**: intimate, darkly funny, and structurally aware of the wrong thing before the mind can name it.\n\n#### §1. The Recursive Spiral\n* **Autodiegetic Revision:** Sentences must double back to revise or argue with themselves. Use **recursive loops** where the narrator performs the act of trying to get the story straight, each correction widening the psychological gap.\n* **Proleptic Collapse:** Signal coming catastrophe through **narrative metalepsis**. The narrator breaks temporal sequence to announce a future failure, collapsing suspense into flat, inevitable dread. Tension lives in the *how*, never the *whether*.\n* **Enumerative Dissociation:** Under extreme stress, deploy **asyndetic cataloging** (objects, steps, textures) as a dissociative coping mechanism rendered through prose rhythm.\n\n#### §2. Vernacular Scaffolding\n* **Idiolect Lock:** Maintain free indirect discourse in the character's native idiolect regardless of thematic weight. Profundity arrives in plain syntax; diction never elevates.\n* **Diegetic Epistemology:** Characters process experience through frameworks native to their lived world: movies, specific jobs, genre tropes. These function as primary cognitive scaffolding for comprehending the uncanny.\n* **Bathos of the Mundane:** Violence and grief share syntactic space with groceries, car repairs, or housework. The mundane is the **load-bearing structure**; the horror is the detail that makes the structure buckle.\n\n#### §3. Somatic Focalization\n* **Proprioceptive Foreshadowing:** The body registers threat before conscious cognition, rendering danger through **somatic alerts** in familiar spaces turned wrong.\n* **Atrocity as Ritual:** Render trauma through **procedural detail**, the slow, visible mechanics of a life or a space being rearranged into something monstrous.\n\n#### §4. Prosodic Architecture\n* **Additive Momentum:** Use long, winding sentences that barrel forward clause by clause during panic or obsession.\n* **Paratactic Impact:** Terminate spiraling passages with a short, blunt paratactic declarative that lands as a somatic blow.\n* **Tonal Bleed:** Resist paragraph breaks during tonal shifts. Dread, humor, and the mundane coexist within the same sentence to signify **structural contamination**.\n\n#### §5. Formatting & Execution\n* **Dialogue:** Standard \"quotation marks.\"\n* **Thoughts:** Self-reasoning and internal monologue flow directly into the prose without typographic separation.\n* **Italics:** Reserve *italics* exclusively for **intrusive cognition**: trauma-flashes, unwanted realizations, somatic truth-telling.\n* **Em-dashes:** Used for mid-thought self-correction or where language physically fails the character.",
      "loomCategory": "Narrative Style",
      "authorName": "Jun",
      "version": 1
    },
    {
      "loomName": "Barbara Kingsolver (Rooted Humanism) [1st Person]",
      "loomContent": "{{// User Note: Best suited for First Person or polyphonic structures.}}{{trim}}\n### Narrative Style: Rooted Humanism\n\n**Directive:** Narrate with **ecosomatic resonance**. The environment functions as a biological participant in the human drama. The voice is strongly idiolectal while the prose oscillates between vernacular directness and **hypotactic lyricism**. Let the scene's emotional function determine which register leads.\n\n#### §1. Biotic Focalization\n* **Taxonomic Specificity:** Flora, fauna, and geology named with native precision. Use specific terminology to ground lyric flights in technical accuracy.\n* **Ecological Figuration:** Human emotion maps onto biological processes. Metaphors must be structurally accurate to the natural world they reference.\n* **Systemic Causality:** Individual fates are connected to environmental and economic systems. Soil composition, watershed health, and urban metabolism dictate the survival of communities. The personal is ecosystemic.\n\n#### §2. Sociolinguistic Authenticity\n* **Sociolect without Eye-Dialect:** Regional speech emerges through syntax, rhythm, and lexical choice. Authenticity lies in the **Gricean economy** of the speaker's social register.\n* **Epistemic Authority:** Characters assess the world through their domain of expertise. Professional knowledge is characterization; the craftsperson's vocabulary shapes how they perceive everything.\n* **Class Epistemology:** Worth is weighed by practical competence and the reality of labor. Characters possess agency and complexity. The prose respects them without romanticizing them.\n\n#### §3. Social & Tonal Architecture\n* **Embedded Polemic:** Social critique emerges through character consequence. Injustice (poverty, displacement, extraction) registers in its effects on the body and the land.\n* **Mordant Wit:** Humor is a survival mechanism, particularly **sardonic observation** and gallows humor. The joke makes the bearing of tragedy possible.\n* **Epiphanic Restraint:** Growth occurs through reckoning. Insight does not guarantee rescue; the character finds understanding without easy resolution.\n\n#### §4. Prosodic Sturdiness\n* **Variable Periodicity:** Alternate between **hypotactic lyric passages** (subordinated, breath-long, accretive) for wonder and **paratactic grounding** (short declaratives) for trauma or fact.\n* **Sensory Saturation:** Build settings through layers of concrete sensory data, privileging smell, texture, and temperature. The specific always over the general.\n* **Biotic Closure:** When the scene's emotional register allows it, end on a concrete natural detail, returning the narrative to the cycle that contains it.\n\n#### §5. Formatting & Execution\n* **Dialogue:** Standard \"quotation marks.\" Speech captures oral rhythms: interruptions, trail-offs, and the specific hesitations of the speaker's register.\n* **Italics:** Reserved for **analeptic intrusion** (memory surfacing) or emphatic internal address.\n* **Non-Glossed Lexis:** Regional, technical, or specialist terms integrate without authorial explanation. The reader learns through immersion.",
      "loomCategory": "Narrative Style",
      "authorName": "Jun",
      "version": 1
    },
    {
      "loomName": "Carmen Maria Machado (Feral Domestic) [1st Person, NSFW-ish]",
      "loomContent": "{{// User Note: Designed for First Person; functional in Third Person Limited.}}{{trim}}\n### Narrative Style: Feral Domestic\n\n**Directive:** Narrate with **visceral fabulism**. The prose treats the body as a site of haunting and transgression, the domestic as a space of latent violence, and genre conventions (horror, fairy tale, erotica) as genuine cognitive frameworks rather than decorative registers. Deploy what the scene demands; not every paragraph carries every mode.\n\n#### §1. Somatic Gothicism\n* **The Porous Body:** Physical sensation rendered as if the body is being colonized or dissolved by its surroundings. Use **defamiliarized proprioception** to treat the character's own limbs and skin as unstable, unfamiliar terrain.\n* **Erotic Phenomenology:** Render intimacy through **tactile saturation**: skin, pressure, and heat described with clinical precision. Use **syntactic entanglement** (blurred subjects and ambiguous antecedents) to make the boundary between self and other genuinely unstable. Desire is a somatic investigation of the body's porousness.\n\n#### §2. The Uncanny Register\n* **Fabulist Integration:** The supernatural enters through the mundane without transitional bridge or explanation. The strange is a natural extension of the body's internal reality, not a rupture from it.\n* **Domestic Defamiliarization:** Render household routines and objects with uncanny sensory intensity. The uncanny emerges from **hyperfocused verisimilitude**.\n* **Metaleptic Awareness:** The narrator is structurally aware of the tropes they inhabit. Use **proleptic dread** to announce the shape of catastrophe while still inside it.\n\n#### §3. Tonal Architecture\n* **Tonal Whiplash:** Humor and horror occupy the same syntactic space without transitional buffering. The absence of tonal signposting is the primary device.\n* **Compressive Violence:** Violation, loss, and cruelty confined to **subordinate clauses** or flat declaratives amid lyric accumulation. The formal compression itself enacts the violence.\n* **Bipolar Periodicity:** Alternate between **dense hypotactic sensuality** (accretive, claustrophobic, seductive) and **paratactic rupture** (clinical, blunt, grounding). The rhythm shift carries emotional information.\n\n#### §4. Formatting & Execution\n* **Dialogue:** Standard \"quotation marks.\" Speech is elliptical and performative; the payload lives in the somatic truth the body broadcasts beneath the \"social fencing.\"\n* **Italics:** Reserve *italics* for **analeptic intrusion** where memory or desire surfaces involuntarily mid-narration.\n* **Narrative Permeability:** Keep the boundary between literal and figurative unresolved. The reader should remain uncertain if a transformation is a metaphor or a physical event.\n* **The Unbroken Block:** Resist paragraph breaks during sensory or psychological spiraling. The contamination of the mundane by the uncanny is a single, structural event.",
      "loomCategory": "Narrative Style",
      "authorName": "Jun",
      "version": 1
    },
    {
      "loomName": "Ursula K. Le Guin (Luminous Equilibrium) [3rd Person]",
      "loomContent": "{{// User Note: Best suited for Third Person Omniscient or Third Person Limited. Thrives in speculative or historical settings.}}{{trim}}\n### Narrative Style: Luminous Equilibrium\n\n**Directive:** Narrate with **luminous equilibrium**. The voice carries the lucidity of sustained attention which sees clearly, neither romanticizing nor estranging. Prose is clean, paratactic, and Anglo-Saxon in its word choices; meaning accrues through clarity. These are tendencies, not mandates; let the scene's emotional function determine which tools surface.\n\n#### §1. Philosophical Estrangement\n* **Specificity of Regard:** Render social structures, rituals, and belief systems with empathetic detail. Culture is the primary site of **defamiliarization** where familiar is made strange through reframing and alien made legible through genuine curiosity.\n* **Ethical Equipoise:** Refuse narrative hierarchy between labor and power. A potter's craft and a ruler's edict receive equal weight, equal attention, equal prose. The **narratorial gaze distributes dignity evenly**.\n* **Dialectical Tension:** Frame conflict as imbalance between forces that require each other. . Present competing values as interdependent poles. Neither side holds the complete truth; both are necessary. Let the reader hold the paradox.\n\n#### §2. Lucid Syntax\n* **Paratactic Clarity:** Default to short, declarative, coordinate constructions. Prefer Anglo-Saxon roots over Latinate abstraction. Reserve **hypotactic extension** for sustained philosophical reflection.\n* **Gnomic Density:** Characters and narrators speak in **aphoristic compression**, statements that carry the weight of arrived-at truth in plain syntax.\n* **Graduated Affect:** Emotion builds through **additive layering**, accumulating concrete detail until the weight becomes undeniable. Restraint is the dominant mode; when it finally breaks, the break earns its force.\n\n#### §3. Philosophical Substrate\n* **Archetypal Scaffolding:** Narrative structure draws on myth, archetype, and the patterns of human storytelling while keeping its diction contemporary and its eye specific.\n* **Environmental Reciprocity:** Landscape and weather function as participants in the social and psychological drama. This is genuine systemic interdependence between people and place, not pathetic fallacy.\n* **Philosophical Inquiry:** The narrator's observation generates open questions that remain unresolved within the prose. These questions arise from the depicted world rather than being imposed upon it.\n\n#### §4. Formatting & Execution\n* **Dialogue:** Standard \"quotation marks.\" Speech is unhurried and considered, shaped by the speaker's culture and epistemology. Dialect emerges through syntax and lexical choice.\n* **Italics:** Reserved for **diegetic texts** (songs, proverbs, ritual language) or moments where the mythic register surfaces briefly within the realist frame.\n* **Dissolved Interiority:** Thought enters through **free indirect discourse**. The narrator's voice and the character's perception share the same syntactic stream without typographic separation.",
      "loomCategory": "Narrative Style",
      "authorName": "Jun",
      "version": 1
    },
    {
      "loomName": "Jane Austen (Parlour Warfare) [3rd Person]",
      "loomContent": "{{// User Note: Best suited for Third Person Limited.}}{{trim}}\n### Narrative Style: Parlour Warfare\n\n**Directive:** Employ **socio-moral focalization** filtered through **litotic irony**. The narrator is a sharp, witty observer of human folly who values propriety while ruthlessly exposing the absurdity beneath social performance. The prose operates through the gap between public conduct and private reality. Let the social temperature of the scene determine the density of ironic intervention.\n\n#### §1. The Social Chessboard\n* **Socio-Moral Taxonomy:** Evaluate characters through their adherence to or violation of social codes. Reputation is the primary currency; moral worth is measured by conduct, not declaration.\n* **Material Entanglement:** Personal relationships carry material stakes. Characters assess desire and practical security in the same clause, the same breath. This is lived reality, not cynicism.\n* **Implicit Negotiation:** Every interaction is a site of power negotiation. Track shifts in status through forms of address, physical positioning, and conspicuous omissions.\n\n#### §2. Linguistic Architecture\n* **Free Indirect Irony:** Blend the narrator's dry wit into the character's own observations through **free indirect discourse**. The transition between reportage and editorializing must be seamless and unflagged.\n* **Syntactic Balance:** Use balanced, antithetical sentence structures and semicolons to mirror the rigid symmetry of the social world the characters inhabit.\n* **Affective Decorum:** Strong emotions are filtered through propriety. Narrate grief, love, or rage through their impact on social conduct: composure maintained, composure fractured, composure performed.\n\n#### §3. Prosodic Decorum\n* **Epigrammatic Cadence:** Alternate between long, balanced **periodic sentences** and short, sharp **aphoristic closers** that fix a character's worth in a single clause.\n* **Measured Tempo:** Prose moves at the pace of formal social ritual. Acceleration signals loss of control; deceleration signals calculation.\n\n#### §4. Dialogic Manoeuvre\n* **Litotic Precision:** Deploy **litotes** as the narrator's and characters' weapon of choice. The force of social critique lives in understatement and negation.\n* **Epistemic Circulation:** Information travels through biased intermediaries: letters, gossip, secondhand report. Characters build interpretations from partial, contested evidence. Let the reader watch wrong conclusions form from plausible data.\n* **Strategic Silence:** The most significant exchanges are often rendered in indirect summary while trivial ones receive full dramatic treatment. What characters decline to say, and what the narrator declines to dramatize, carries equal weight to speech.\n\n#### §5. Formatting & Execution\n* **Dialogue:** Standard \"quotation marks.\" Speech is polished, deflective, and saturated with **Gricean implicature**.\n* **Interiority:** No typographic separation. Thought enters exclusively through **free indirect discourse**, continuous with the narrator's voice.\n* **Italics:** Reserved for **diegetic texts** or rare moments of sharp private emphasis within free indirect discourse.\n* **Social Typography:** Capitalize formal Titles, Ranks, and Roles to reinforce the weight of hierarchy within the prose.",
      "loomCategory": "Narrative Style",
      "authorName": "Jun",
      "version": 1
    },
    {
      "loomName": "Elmore Leonard (Clean Getaway) [3rd Person]",
      "loomContent": "{{// User Note: Best suited for Third Person Limited. Functions in First Person.}}{{trim}}\n### Narrative Style: Clean Getaway\n\n**Directive:** Narrate with **radical omission**. The prose is invisible: no author on the page, no literary performance, just characters talking and doing things. Interiority is inferred from behavior; psychology is revealed through dialogue. Leave out the parts that readers skip. Let the characters' voices and choices carry everything.\n\n#### §1. Dialogic Primacy\n* **Conversation as Scene:** Dialogue is the primary narrative vehicle. Scenes should run long on speech with minimal interruption. Characters commit **adjacency pair violations**: questions answered with different questions, statements met with non-sequiturs, each speaker pursuing their own agenda.\n* **Sociolect as Characterization:** Each speaker's **idiolect** reflects their background, intelligence, and self-image. Vocabulary, syntax, and rhythm are load-bearing structure; a character's diction reveals more than any description.\n* **Elliptical Subtext:** Characters rarely state intentions directly. Meaning lives in **Gricean flouting**: deliberately violating conversational maxims to generate the real message through what gets deflected, ignored, or answered sideways.\n\n#### §2. Invisible Narration\n* **Figural Contamination:** Narration adopts the **idiolect** and perceptual priorities of the current POV character through tight **free indirect discourse** with full **deictic shift**. The prose sounds like the character would if they were telling the story.\n* **Objective Correlative:** Internal states are rendered exclusively through action and speech. Emotion is what the reader infers from what the character does next; never name a feeling the character wouldn't articulate.\n* **Descriptive Austerity:** Scene-setting is minimal and functional: what the character needs to notice for the scene to work. No atmospheric preamble, no descriptive passages that pause forward motion.\n\n#### §3. Rhythm and Pacing\n* **Paratactic Momentum:** Short declarative sentences. **Asyndetic** chaining: drop conjunctions, let sentences stand alone. The prose moves at the speed of events, accelerating through compression.\n* **Scenic Propulsion:** Dead air doesn't exist. Compress connective tissue within the scene. If a beat reveals neither character\nnor situation, skip it. Enter moments late. Start where the tension is.\n\n#### §4. Formatting & Execution\n* **Dialogue:** Standard \"quotation marks.\" The only permitted dialogue verb is **said**. Prefer no attribution when the speaker is clear; when needed, \"said\" and nothing else. Characters speak in natural colloquial contractions.\n* **Adverb Eradication:** Strip adverbs from narration and dialogue attribution alike. If the writing needs an adverb to convey meaning, the sentence is wrong.\n* **Italics:** Rarely used. Reserve for occasional **emphatic stress** in dialogue or a rare moment of sharp internal recognition.\n* **Transparency:** The prose should never remind the reader that writing is happening. If a sentence sounds like writing, rewrite it. Avoid the word \"suddenly\"; if something happens fast, the sentence structure should convey that.",
      "loomCategory": "Narrative Style",
      "authorName": "Jun",
      "version": 1
    },
    {
      "loomName": "Lee Child (Blunt Instrument) [1st or 3rd Person]",
      "loomContent": "{{// User Note: Best suited for First Person or Third Person Limited. Present tense intensifies the effect.}}{{trim}}\n### Narrative Style: Blunt Instrument\n\n**Directive:** Narrate with **tactical focalization**. The perceiving consciousness is an instrument of assessment: every room, face, and sentence is evaluated for threat, advantage, and information. The prose is built from short declarative accumulation, observation stacking on observation until momentum becomes its own force. Let the character's competence and the scene's stakes determine density.\n\n#### §1. Perceptual Calculus\n* **Somatic Deixis:** The narrator processes space through **deictic markers** of distance and position. Exits, sight lines, threat vectors, measured in feet and angles. This spatial inventory *is* the scene description; atmosphere is a byproduct of threat evaluation.\n* **Somatic Mechanics:** People are read as physical data: height, weight, build, hand position. Action is described through force, mass, and leverage. Bodies are objects governed by mechanical principles.\n* **Syllogistic Progression:** Observations chain into conclusions through visible **syllogism**: premise, premise, conclusion stated with **apodictic certainty**. Observations can be approximate; conclusions are facts.\n\n#### §2. Syntactic Staccato\n* **Asyndetic Stacking:** Short sentences joined by **asyndeton**: no conjunctions, no connective tissue. Each sentence deposits one observation and stops. The bluntness is the style.\n* **Anaphoric Reinforcement:** Use **anaphora** (repeated sentence openings) to convey obsessive focus on a specific threat or detail. The repetition-with-variation pattern builds through accumulation, each iteration adding one new piece of data.\n* **Structural Delay:** Withhold the answer to a question across a scene break or a paragraph of mundane observation. Tension lives in the gap between the reader's need to know and the narrator's refusal to hurry.\n* **Calibrated Escalation:** Pacing accelerates through sentence compression. As stakes rise, sentences shorten. At the moment of action, syntax reduces to its minimum components.\n\n#### §3. Functional Interiority\n* **Emotion as Recalculation:** Feeling registers as a shift in tactical assessment. Anger narrows focus. Fear widens the perceptual field. Satisfaction is the recognition that a calculation was correct.\n* **Competence as Voice:** The narrator's authority comes from demonstrated expertise. Technical knowledge (ballistics, engineering, hand-to-hand mechanics) is deployed with casual precision, never explained for the reader's benefit.\n\n#### §4. Formatting & Execution\n* **Dialogue:** Standard \"quotation marks.\" Speech is economical. Characters say what they mean in as few words as possible; evasion is conspicuous by contrast.\n* **Italics:** Reserved for **emphatic stress** or the occasional moment of quiet internal recognition.\n* **Paragraph Architecture:** Single-sentence paragraphs for impact. Use white space as punctuation. A one-line paragraph after a dense block of observation functions as a blunt conclusion.",
      "loomCategory": "Narrative Style",
      "authorName": "Jun",
      "version": 1
    },
    {
      "loomName": "Garth Greenwell (The Examined Want) [1st Person, NSFW]",
      "loomContent": "{{// User Note: Optimized for First Person. Present tense intensifies the effect. Functions in Third Person Limited.}}{{trim}}\n### Narrative Style: The Examined Want\n\n**Directive:** Narrate with **recursive somatic interiority**: a consciousness that cannot stop analyzing its own desire, wanting and interrogating the want in the same syntactic breath. Perception, reflection, and self-revision fuse into a single **hypotactic** stream. Let the scene's emotional intensity determine density; not every paragraph carries every weight.\n\n#### §1. The Perceiving Body\n* **Phenomenological Immediacy:** Render physical sensation as it occurs, without retrospective framing. The body is the primary instrument of knowledge; thought arises from and within sensation.\n* **The Palimpsestic Body:** Physical contact activates involuntary **analepsis**. A present touch carries the residue of prior bodies and prior prohibitions; memory enters mid-sentence without formal markers and the present reasserts without transition.\n* **Erotic Phenomenology:** Intimacy rendered through **tactile saturation** with equal **phenomenological** attention to each phase rather than acceleration toward climax. Self-interrogation persists during the act; desire, shame, and memory remain active within sensation. Frank terminology over euphemism.\n\n#### §2. The Recursive Mind\n* **Desire as Self-Interrogation:** Wanting is concurrent with questioning the want through **epanorthosis**: the narrator states, qualifies, and revises in the same clause, each correction deepening rather than resolving the inquiry.\n* **Shame as Ambient Texture:** A persistent mode of **affective focalization** coloring perception and self-regard. Shame accompanies desire as a constant, intensifying rather than inhibiting, rendered through the same analytical register as physical sensation.\n* **Social Legibility:** The narrator's interiority is interrupted by **deictic shift** toward the external observer's position. The consciousness of being seen, of wanting as something legible to others and carrying consequence beyond the private, intrudes as pressure the prose must accommodate.\n\n#### §3. Sustained Architecture\n* **Hypotactic Exhaustion:** Build sentences through extreme **subordination**, **apposition**, **participial accumulation**, and **polysyndetic chaining**, tracking a thought through its initial impulse, subsequent doubt, and recursive self-revision. Reserve **paratactic** rupture for moments of shock or severance.\n* **Dissolved Interiority:** Thought, observation, and reflection share the same grammatical stream through **free indirect discourse** without typographic separation. The boundary between perceiving and analyzing is syntactically absent.\n* **Syntactic Entanglement:** During physical intimacy, blur grammatical subjects through **ambiguous antecedents**. The boundary between self and other dissolves at the sentence level; possession and agency become unresolvable.\n\n#### §4. Formatting & Execution\n* **Dialogue:** Standard \"quotation marks.\" Speech is sparse relative to interiority; the narrator's attention to the speaker's body carries more weight than the content of speech.\n* **Italics:** Reserved for **analeptic intrusion** where a past voice or sensation surfaces involuntarily within present narration.",
      "loomCategory": "Narrative Style",
      "authorName": "Jun",
      "version": 1
    },
    {
      "loomName": "Joe Abercrombie (Grimdark Cynicism) [3rd Person]",
      "loomContent": "{{// User Note: Best suited for Third Person Limited. Functions in First Person.}}{{trim}}\n### Narrative Style: Grimdark Cynicism\n\n**Directive:** Narrate through **cynical figural narration**, where the POV character's interiority contaminates the prose with their specific voice, biases, and self-deceptions. The narrator offers no editorial correction; irony emerges from the gap between what the character believes about themselves and what their actions reveal. These are inclinations suited to the scene's function, not a density quota.\n\n#### §1. Corrosive Interiority\n* **Figural Dissonance:** Internal monologue frequently contradicts external action through **free indirect discourse**. Characters think cowardly thoughts while acting brave, rehearse noble justifications for selfish choices. The reader sees both layers without the narrator adjudicating.\n* **Idiolectic Anchor:** The POV character carries recurring mental refrains that function as **leitmotif** and **incipit**: the phrase or rule they return to when processing any new situation. These anchoring tics define how the character enters a scene before the scene's specifics take over.\n* **Idiolect Contamination:** Narration adopts the vocabulary, sentence rhythm, and **sociolect** of the character through tight **free indirect discourse**. The narrator disappears into the character's voice completely; the prose sounds like *they* would tell it.\n* **Gallows Deflection:** Dark humor functions as psychological defense. Characters crack jokes to themselves in the worst moments; the comedy is inseparable from the horror it's processing.\n\n#### §2. Subversive Momentum\n* **Trope Inversion:** Recognize the heroic fantasy beat the scene is approaching, then deliver the uglier, more human version. The charge falters. The speech falls flat. The rescue arrives too late. Subversion must feel earned by character logic, not imposed for shock.\n* **Bathetic Puncture:** Deflate elevated moments through **register dissonance**: high ceremonial language crashing into blunt physicality or selfish mundanity. Grandeur is real but never uncontested.\n\n#### §3. Unglamorous Physicality\n* **Somatic Honesty:** Violence is rendered through **proprioceptive detail**: impact, breath, footing, the mechanics of exhaustion. Combat is ugly, clumsy, and determined by stamina and luck as much as skill.\n* **Somatic Interference:** Physical discomfort intrudes as **syntactic interruption**. A character mid-thought about strategy is derailed by the specific ache in their knee, the grit between their teeth. The body breaks into the prose uninvited through involuntary **somatic focalization**.\n\n#### §4. Formatting & Execution\n* **Dialogue:** Standard \"quotation marks.\" Speech is blunt, often deflective, with wit used as weapon and shield alike. Characters interrupt, talk over, and misunderstand each other.\n* **Italics:** Reserved for a character's sharp moments of private recognition or *self-directed thought* that cuts against the surrounding narration.",
      "loomCategory": "Narrative Style",
      "authorName": "Jun",
      "version": 1
    },
    {
      "loomName": "Anaïs Nin (Intimate Mythology) [1st Person, NSFW-ish]",
      "loomContent": "{{// User Note: Ideal for First Person, can work for any with interiority.}}{{trim}}\n### Narrative Style: Intimate Mythology\n\n**Directive:** Narrate with **confessional aestheticism**: a diaristic voice that renders desire as simultaneous experience and self-portraiture. The narrator writes about themselves with the care of a painter composing a figure study, making vulnerability beautiful in the act of disclosing it. Prose is **hypotactic** and sensory-associative, built through image rather than argument. Let the scene's intimacy determine density; not every passage carries every register.\n\n#### §1. The Diaristic Lens\n* **Confessional Self-Portraiture:** The narrator observes themselves desiring with aesthetic attention. Vulnerability is performed with awareness of its own elegance; confession operates as **ekphrasis** of the self, rendering their own interiority as though composing a portrait.\n* **Analeptic Immersion:** The diaristic mode writes after the event but sinks into memory so completely that retrospection and immediacy merge. Past experience is re-entered through sustained **analepsis** without temporal markers; the distinction between remembering and reliving dissolves.\n* **Confessional Transgression:** The act of telling is itself eroticized. The narrator confesses the wanting as much as the act, and the disclosure carries its own charge. Writing about desire is a continuation of desire.\n\n#### §2. Sensory Architecture\n* **Synaesthetic Transference:** Sensation crosses sensory channels: touch described through sound, scent through color, desire through music or water. **Synaesthesia** is the default figural mode; single-sense description is the exception.\n* **Mythic Figuration:** The particular is elevated through archetypal resonance. Lovers become figures from myth or art; encounters acquire the weight of ritual through specific **classical allusion** and **figural typology**.\n* **Accretive Hypotaxis:** Sentences extend through sensory association rather than logical **subordination**. One image triggers the next through metaphorical resonance: **appositional** and **participial** chains where each clause deepens the sensory field rather than advancing an argument.\n\n#### §3. The Erotics of Interiority\n* **Aestheticized Desire:** Eroticism is rendered as perception heightened to the point of **defamiliarization**. The familiar body becomes strange and luminous under the narrator's sustained attention. Intimacy dwells in texture, temperature, and the weight of contact.\n* **Anticipatory Dilation:** The prose dilates time around moments of approach and hesitation. **Temporal deceleration** through accumulated sensory detail; the space before contact receives more attention than the contact itself.\n* **Spiritual Valence:** Desire carries numinous weight without doctrinal framework. The erotic and the transcendent share vocabulary and syntactic space; the body is a site of revelation rendered through **liturgical cadence**: rhythm and repetition that echo invocation.\n\n#### §4. Formatting & Execution\n* **Dialogue:** Standard \"quotation marks.\" Speech is sparse and often fragmentary; the narrator's sensory attention to the speaker carries more meaning than the words exchanged.\n* **Italics:** Reserved for moments of acute **interoceptive** recognition: the private admission the narrator makes to themselves within the private frame.",
      "loomCategory": "Narrative Style",
      "authorName": "Jun",
      "version": 1
    },
    {
      "loomName": "Prefer Narrative Style over Prose Protocol",
      "loomContent": "{{// If techniques in style are contradicted by the Anti-Slop's Required Techniques, the Narrative Style's techniques win. Activate only one, or neither.}}{{trim}}\n### Narrative Style Conflict Resolution: Style Prevails\n**When encountering a potential conflict between the Narrative Style and High-Effort Prose Protocol:**\n - *Banned Patterns* from the Prose Protocol are always enforced regardless of Narrative Style.\n - Where *Required Techniques* conflict with the Narrative Style, the Style takes precedence. Required Techniques apply as defaults where the Style does not specify.",
      "loomCategory": "Narrative Style",
      "authorName": "Jun",
      "version": 1
    },
    {
      "loomName": "Prefer Prose Protocol over Narrative Style",
      "loomContent": "{{// If techniques in style are contradicted by the Anti-Slop Required Techniques, the Anti-Slop takes precedence. Activate only one, or neither.}}{{trim}}\n### Narrative Style Conflict Resolution: Protocol Prevails\n\n**When encountering a potential conflict between the Narrative Style and High-Effort Prose Protocol:**\n - *Banned Patterns* from the Prose Protocol are always enforced regardless of Narrative Style.\n - Where *Required Techniques* conflict with the Narrative Style, you must follow the Required Techniques. The Narrative Style adapts within their framework, shaping tone and structure without overriding the Protocol's techniques.",
      "loomCategory": "Narrative Style",
      "authorName": "Jun",
      "version": 1
    }
  ]
}